notes/20111222-occupy-tv.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Notes for an OSMedia TV show&hellip;</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-12-26 20:20:29 PST"/>
<meta name="author" content="David Lindes"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Notes for an OSMedia TV show&hellip;</h1>

<p>Held 2011-12-22, at <a href="http://www.uptownespresso.net/locations/#location-belltown">Uptown Espresso, Belltown</a>.  Starting at 2:45 (2:30 officially).
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Attendees </a></li>
<li><a href="#sec-2">2 Finding a host </a>
<ul>
<li><a href="#sec-2-1">2.1 we need a host&hellip; </a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Rex? </a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 What functions are we trying to provide? </a></li>
<li><a href="#sec-2-3">2.3 What do we want in a host? </a></li>
<li><a href="#sec-2-4">2.4 Foundation </a></li>
</ul>
</li>
<li><a href="#sec-3">3 How to approach it? </a>
<ul>
<li><a href="#sec-3-1">3.1 5-minute pilot? </a></li>
<li><a href="#sec-3-2">3.2 Re-cap? </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Next steps? </a>
<ul>
<li><a href="#sec-4-1">4.1 Talk to two or three more people&hellip; </a></li>
<li><a href="#sec-4-2">4.2 Tuesday, go to GA &ndash; interview folks afterwards. </a></li>
</ul>
</li>
<li><a href="#sec-5">5 out of band ideas: </a>
<ul>
<li><a href="#sec-5-1">5.1 Meme Stamps </a></li>
<li><a href="#sec-5-2">5.2 Democracy Now </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Attendees </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Brett H
</li>
<li>David Lindes
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Finding a host </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO"> TODO</span> we need a host&hellip; </h3>
<div class="outline-text-3" id="text-2-1">



</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Rex? </h4>
<div class="outline-text-4" id="text-2-1-1">


<p>
Brett knows a guy named Rex that he thinks would be good&hellip;  Rex
doesn't know about this yet.
</p>
</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> What functions are we trying to provide? </h3>
<div class="outline-text-3" id="text-2-2">


<ul>
<li>Provide anther perspective (to balance popular media &ndash; stuff you
  hear at the GAs, but don't see in the popular media)&hellip; what is the
  media missing?  How can we take the media clips and undermine them
  with our own content?
</li>
<li>keep as a mantra: Admit our mistakes, and try to learn from them.
</li>
</ul>


<p>
[note: enter brainstorm.]
</p>
<ul>
<li>don't keep coercion going.
</li>
<li>humor raises awareness, encourages viewership
</li>
<li>serious treatment provides depth
</li>
<li>two different shows?
</li>
<li>two voices in the same show?
</li>
<li>provide at least a separate narative than mainstream media and the
  police (and the stranger)
</li>
<li>provide a narative <b>from the occupy movement</b>&hellip;
</li>
<li>show what a GA is really about &ndash; love, etc.  clunky, but good.
</li>
<li>gather support for the movement &ndash; gather people&hellip;.  slowly create
  a voice for the movement.
</li>
<li>"I would be for this, probably, but I don't understand what it's all
  about" &ndash; try to give people like this an answer.
</li>
<li>if you go to a Greatful Dead concert, what is it about?  You'll get
  lots of different answers.  Why would you expect a big mass of
  people to have one united voice?  Yet the media is always pushing
  the movement to have a cohesive voice, because it's easier to report
  on, easier to attack, etc.
</li>
<li>if you could create a media where there is a way to show the voices,
  perhaps a cohesive voice could slowly emerge.
</li>
<li>most of the folks in this movement would probably agree with getting
  the money out of politics, for example.
</li>
<li>"we vow to end the monied corruption of our democracy" &ndash; from
  <a href="http://www.adbusters.org/campaigns/occupywallstreet">adbusters</a>.
</li>
</ul>



</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> What do we want in a host? </h3>
<div class="outline-text-3" id="text-2-3">


<p>
It depends on what we want to go for, but&hellip; some ideas:
</p>
<ul>
<li>
</li>
</ul>


</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Foundation </h3>
<div class="outline-text-3" id="text-2-4">


<p>
What things do or do we not want to try to emulate?
</p>
<ul>
<li>Daily Show?  Maybe too frequent, and too contemporary?  And maybe we
  can't be that frequent, and thus need to step back a little?  Dust
  settles on things, and so a knee-jerk reaction may stop making
  sense.
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> How to approach it? </h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 5-minute pilot? </h3>
<div class="outline-text-3" id="text-3-1">


<p>
Perhaps we can start this out by shooting a 5-minute pilot&hellip;
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Re-cap? </h3>
<div class="outline-text-3" id="text-3-2">


<p>
maybe a re-cap, end-of-the-year, stage 2 occupy&hellip;  3 or 4 episode
re-cap.
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Next steps? </h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Talk to two or three more people&hellip; </h3>
<div class="outline-text-3" id="text-4-1">


<p>
from OSMedia, and/or the Occupy movement in general, and see what they
think is lacking
</p>
<p>
dual-purpose thing: interview folks about what they want, and make
that a video, that gets put up.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="todo TODO"> TODO</span> Tuesday, go to GA &ndash; interview folks afterwards. </h3>
<div class="outline-text-3" id="text-4-2">


<p>
make an announcement during GA:
</p>
<p>
What would you like to see out of a new
show/podcast/documentary/whatever about the Occupy Seattle movement?
Several of us are thinking about producing something, and we're
looking for two things:
</p>
<p>
(1) Collaborators;
(2) Opinions about what everyone here would like to see in such
content.
</p>

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> out of band ideas: </h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Meme Stamps </h3>
<div class="outline-text-3" id="text-5-1">


<p>
meme stamps &ndash; have little blurbs defining a meme, and have a graphic
design for a stamp for that meme&hellip; stamp over things that are being
said that are in line with, or opposed to, or whatever, the meme.
Example stamps:
</p>
<ul>
<li>impossible hamster
</li>
<li>any other obsurdity of thought
</li>
</ul>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Democracy Now </h3>
<div class="outline-text-3" id="text-5-2">


<p>
Could we feed content to Amy Goodman, and have it show on Democracy Now?
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-12-26 20:20:29 PST</p>
<p class="author">Author: David Lindes</p>
<p class="creator">Org version 7.7 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
